[
  {
    "component": "Frontend Platform",
    "technologies": "Next.js (App Router)",
    "rationale": "Next.js App Router combines file-based routing, shared layouts, and Server Actions so the UI, data mutations, and SEO-friendly pages stay cohesive without extra wiring."
  },
  {
    "component": "Frontend Styling",
    "technologies": "Tailwind CSS ",
    "rationale": "Tailwind centralizes design tokens and utilities for fast responsive layouts, keeping styles consistent without heavy custom CSS."
  },
  {
    "component": "Component Library",
    "technologies": "Shadcn",
    "rationale": "Shadcn/UI wraps Radix primitives with accessible defaults, speeding up production-ready prototyping with composable components."
  },
  {
    "component": "Mobile App Framework",
    "technologies": "Expo React Native",
    "rationale": "Expo supports cross-platform development from one codebase with integrated tooling, OTA updates, and easy device testing."
  },
  {
    "component": "Mobile Styling",
    "technologies": "Nativewind",
    "rationale": "Nativewind brings Tailwind-style utilities to React Native to keep styling consistent between web and mobile."
  },
  {
    "component": "Mobile Storage",
    "technologies": "MMKV",
    "rationale": "MMKV is a high-performance key-value store for caching user sessions and tokens on device."
  },
  {
    "component": "Backend API",
    "technologies": "NestJS (TypeScript), Zod",
    "rationale": "NestJS provides a modular, testable API structure, while Zod enforces type-safe validation across request and response contracts."
  },
  {
    "component": "Database/ORM",
    "technologies": "MySQL, Drizzle ORM",
    "rationale": "MySQL delivers reliable OLTP storage, and Drizzle ORM offers a lightweight, type-safe query layer."
  },
  {
    "component": "State Management",
    "technologies": "React Query, Zustand",
    "rationale": "React Query manages server-state caching and synchronization, while Zustand keeps local UI state minimal and predictable."
  }
]
